zuyih/STM32CubeU3/Projects/NUCLEO-U385RG-Q/Applications/ROT/OEMiROT_Boot/Src/boot_hal.c
/**
  ******************************************************************************
  * @file    boot_hal.c
  * @author  MCD Application Team
  * @brief   This file contains  mcuboot hardware specific implementation
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include "boot_hal_cfg.h"
#include "boot_hal.h"
#include "boot_hal_hash_ref.h"
#include "boot_hal_imagevalid.h"
#include "boot_hal_flowcontrol.h"
#include "stm32u3xx_hal_icache.h"
#include "mcuboot_config/mcuboot_config.h"
#include "uart_stdout.h"
#include "low_level_security.h"
#include "bootutil/boot_record.h"
#include "target_cfg.h"
#include "cmsis.h"
#include "Driver_Flash.h"
#include "region_defs.h"
#include "low_level_rng.h"
#if   defined(MCUBOOT_USE_HASH_REF)
#include "bootutil_priv.h"
#endif

#include "stm32_board.h"
#include "stm32u3xx_hal_conf.h"

extern ARM_DRIVER_FLASH FLASH_DEV_NAME;


#if defined(MCUBOOT_DOUBLE_SIGN_VERIF)
/* Global variables to memorize images validation status */
#if (MCUBOOT_IMAGE_NUMBER == 1)
uint8_t ImageValidStatus[MCUBOOT_IMAGE_NUMBER] = {IMAGE_INVALID};
#elif (MCUBOOT_IMAGE_NUMBER == 2)
uint8_t ImageValidStatus[MCUBOOT_IMAGE_NUMBER] = {IMAGE_INVALID, IMAGE_INVALID};
#elif (MCUBOOT_IMAGE_NUMBER == 3)
uint8_t ImageValidStatus[MCUBOOT_IMAGE_NUMBER] = {IMAGE_INVALID, IMAGE_INVALID, IMAGE_INVALID};
#elif (MCUBOOT_IMAGE_NUMBER == 4)
uint8_t ImageValidStatus[MCUBOOT_IMAGE_NUMBER] = {IMAGE_INVALID, IMAGE_INVALID, IMAGE_INVALID, IMAGE_INVALID};
#else
#error "MCUBOOT_IMAGE_NUMBER not supported"
#endif /* (MCUBOOT_IMAGE_NUMBER == 1)  */
uint8_t ImageValidIndex = 0;
#endif /* MCUBOOT_DOUBLE_SIGN_VERIF */
#if defined(MCUBOOT_DOUBLE_SIGN_VERIF) || defined(MCUBOOT_USE_HASH_REF)
uint8_t ImageValidEnable = 0;
#endif /* MCUBOOT_DOUBLE_SIGN_VERIF || MCUBOOT_USE_HASH_REF */

#if defined(MCUBOOT_USE_HASH_REF)
#define BL2_HASH_REF_ADDR     (FLASH_HASH_REF_AREA_OFFSET)
uint8_t ImageValidHashUpdate = 0;
uint8_t ImageValidHashRef[MCUBOOT_IMAGE_NUMBER * SHA256_LEN] = {0};
#endif /* MCUBOOT_USE_HASH_REF */

#if defined(FLOW_CONTROL)
/* Global variable for Flow Control state */
volatile uint32_t uFlowProtectValue = FLOW_CTRL_INIT_VALUE;
#endif /* FLOW_CONTROL */
volatile uint32_t uFlowStage = FLOW_STAGE_CFG;

/*
#define ICACHE_MONITOR
*/
#if defined(ICACHE_MONITOR)
#define ICACHE_MONITOR_PRINT() printf("icache monitor - Hit: %x, Miss: %x\r\n", \
                                      HAL_ICACHE_Monitor_GetHitValue(), HAL_ICACHE_Monitor_GetMissValue());
#else
#define ICACHE_MONITOR_PRINT()
#endif /* ICACHE_MONITOR */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup BOOT_HAL_Private_Functions  Private Functions
  * @{
  */

#if defined (OEMUROT_ENABLE)
static uint32_t GetPage(uint32_t Addr);
static uint32_t GetBank(uint32_t Addr);

__attribute__((naked)) void boot_jump_to_RSSExt(uint32_t boot_jump_addr1, uint32_t boot_jump_addr2,
                                                uint32_t HdpArea, uint32_t VectorTableAddr);
#else  /* OEMUROT_ENABLE */
__attribute__((naked)) void boot_jump_to_RSS(uint32_t boot_jump_addr1, uint32_t boot_jump_addr2,
                                             uint32_t HdpArea, uint32_t VectorTableAddr);
#endif  /* OEMUROT_ENABLE */

void icache_init(void);
static void SetSysClock(void);
/**
  * @}
  */

#if defined(OEMIROT_FAST_WAKE_UP)
fih_int boot_platform_wakeup(void);
#endif /* OEMIROT_FAST_WAKE_UP */

#if defined (OEMUROT_ENABLE)
/**
  * @brief  Gets the page of a given address
  * @param  Addr: Address of the FLASH Memory
  * @retval The page of a given address
  */
static uint32_t GetPage(uint32_t Addr)
{
  uint32_t page = 0;

  if (Addr < (FLASH_BASE + FLASH_B_SIZE))
  {
    /* Bank 1 */
    page = (Addr - FLASH_BASE) / FLASH_PAGE_SIZE;
  }
  else
  {
    /* Bank 2 */
    page = (Addr - (FLASH_BASE + FLASH_B_SIZE)) / FLASH_PAGE_SIZE;
  }

  return page;
}

/**
  * @brief  Gets the bank of a given address
  * @param  Addr: Address of the FLASH Memory
  * @retval The bank of a given address
  */
static uint32_t GetBank(uint32_t Addr)
{
  uint32_t bank = 0;

  if (Addr < (FLASH_BASE + FLASH_B_SIZE))
  {
    bank = FLASH_BANK_1;
  }
  else
  {
    bank = FLASH_BANK_2;
  }

  return bank;
}

/**
  * @brief  Jumping to next image using RSS service, after erasing SRAM twice
  * @param  boot_jump_addr1 boot_jump_to_RSS address in order to execute twice SRAM erasing
  * @param  boot_jump_addr2 RSS service address (Close and exit HDP Function)
  * @param  HdpArea notifies which hdp area to close, can be a combination of
  *         hdpa area 1 and hdp area 2
  * @param  VectorTableAddr pointer on the vector table containing the reset handler the function
  *         jumps to.
  */
__attribute__((naked)) void boot_jump_to_RSSExt(uint32_t boot_jump_addr1, uint32_t boot_jump_addr2,
                                                uint32_t HdpArea, uint32_t VectorTableAddr)
{
  __ASM volatile(
#if !defined(__ICCARM__)
    ".syntax unified                 \n"
#endif
    "mov     r7, r0                  \n" /* r7 = boot_jump_addr1*/
    "mov     r8, r1                  \n" /* r8 = boot_jump_addr2 (rsslib_sec_Close_Exit_HDP) */
    "mov     r9, r2                  \n" /* r9 = HdpArea (RSSLIB_HDP_AREA1_Msk) */
    "mov     r10, r3                 \n" /* r10 = VectorTableAddr */
    /*"mov     r11, r4                 \n"*/ /* r11 = CloseBound */
    "bl      boot_clear_bl2_ram_area \n" /* Clear RAM before jump */
    "movs    r0, #0                  \n" /* Clear registers: R0-R12, */
    "mov     r1, r0                  \n" /* except R7/R8/R9/R10 */
    "mov     r2, r0                  \n"
    "mov     r3, r0                  \n"
    "mov     r4, r0                  \n"
    "mov     r5, r0                  \n"
    "mov     r6, r0                  \n"
    "mov     r12, r0                 \n"
    "mov     lr,  r0                 \n"
    "mov     r0, r8                  \n" /* r0 = boot_jump_addr2 (rsslib_sec_Close_Exit_HDP) */
    "mov     r1, r9                  \n" /* r1 = HdpArea (RSSLIB_HDP_AREA1_Msk) */
    "mov     r2, r10                 \n" /* r2 = VectorTableAddr */
    "ldr     r3, =0xD6D6D6D6         \n" /* r3 = CloseBound */
    "mov     r8, r4                  \n" /* Clear registers: R8 */
    "mov     r9, r4                  \n" /* Clear registers: R9 */
    "mov     r10, r4                 \n" /* Clear registers: R10 */
    "mov     r11, r4                 \n" /* Clear registers: R11 */
    "bx      r7                      \n" /* Jump to RSS service : typedef uint32_t ( *RSSLIB_S_CloseExitHDPExt_TypeDef)( uint32_t HdpExtArea, uint32_t VectorTableAddr, uint32_t CloseBound ) */
  );
}
#else  /* OEMUROT_ENABLE */
/**
  * @brief  Jumping to next image using RSS service, after erasing SRAM twice
  * @param  boot_jump_addr1 boot_jump_to_RSS address in order to execute twice SRAM erasing
  * @param  boot_jump_addr2 RSS service address (Close and exit HDP Function)
  * @param  HdpArea notifies which hdp area to close, can be a combination of
  *         hdpa area 1 and hdp area 2
  * @param  VectorTableAddr pointer on the vector table containing the reset handler the function
  *         jumps to.
  */
__attribute__((naked)) void boot_jump_to_RSS(uint32_t boot_jump_addr1, uint32_t boot_jump_addr2,
                                             uint32_t HdpArea, uint32_t VectorTableAddr)
{
  __ASM volatile(
#if !defined(__ICCARM__)
    ".syntax unified                 \n"
#endif
    "mov     r7, r0                  \n" /* r7 = boot_jump_addr1*/
    "mov     r8, r1                  \n" /* r8 = boot_jump_addr2 (rsslib_sec_Close_Exit_HDP) */
    "mov     r9, r2                  \n" /* r9 = HdpArea (RSSLIB_HDP_AREA1_Msk) */
    "mov     r10, r3                 \n" /* r10 = VectorTableAddr */
    "bl      boot_clear_bl2_ram_area \n" /* Clear RAM before jump */
    "movs    r0, #0                  \n" /* Clear registers: R0-R12, */
    "mov     r1, r0                  \n" /* except R7/R8/R9/R10 */
    "mov     r2, r0                  \n"
    "mov     r3, r0                  \n"
    "mov     r4, r0                  \n"
    "mov     r5, r0                  \n"
    "mov     r6, r0                  \n"
    "mov     r11, r0                 \n"
    "mov     r12, r0                 \n"
    "mov     lr,  r0                 \n"
    "mov     r0, r8                  \n" /* r0 = boot_jump_addr2 (rsslib_sec_Close_Exit_HDP) */
    "mov     r1, r9                  \n" /* r1 = HdpArea (RSSLIB_HDP_AREA1_Msk) */
    "mov     r2, r10                 \n" /* r2 = VectorTableAddr */
    "mov     r8, r3                  \n" /* Clear registers: R8 */
    "mov     r9, r3                  \n" /* Clear registers: R9 */
    "mov     r10, r3                 \n" /* Clear registers: R10 */
    "bx      r7                      \n" /* Jump to RSS service : typedef uint32_t ( *RSSLIB_S_CloseExitHDP_TypeDef)( uint32_t HdpArea, uint32_t VectorTableAddr ) */
  );
}
#endif  /* OEMUROT_ENABLE */

