zuyih/STM32CubeU3/Projects/NUCLEO-U385RG-Q/Applications/ROT/OEMiROT_Boot/Src/boot_hal.c
#if defined(OEMIROT_FAST_WAKE_UP)
/**
  * @brief This function checks if system wakes-up from low-power mode:
  *        Stand-by mode and shut down mode (depending on HW capability)
  * @note
  * @retval FIH_SUCCESS in case of wake-up
  */
fih_int boot_platform_wakeup(void)
{
  fih_int fih_rc = FIH_FAILURE;

  /* Check Stand-By Flag */
  if (__HAL_PWR_GET_FLAG(PWR_FLAG_SBF))
  {
    fih_rc = FIH_SUCCESS;
  }

  FIH_RET(fih_rc);
}
#endif /* OEMIROT_FAST_WAKE_UP */

/**
  * @brief This function manage the jump to secure application.
  * @note
  * @retval void
  */
void boot_platform_quit(struct boot_arm_vector_table *vector)
{
  static struct boot_arm_vector_table *vt;
#if defined (OEMUROT_ENABLE)
  static FLASH_HDPExtensionTypeDef flash_hdpext;
  uint32_t rsslib_sec_Close_Exit_HDPExt;
#else
  uint32_t rsslib_sec_Close_Exit_HDP;
#endif  /* OEMUROT_ENABLE */
#if defined(MCUBOOT_DOUBLE_SIGN_VERIF)
  uint32_t image_index;

  (void)fih_delay();

#if defined(OEMIROT_FAST_WAKE_UP)
  fih_int fih_rc = FIH_FAILURE;

  /* Check if wake-up from low-power to bypass images revalidation */
  FIH_CALL(boot_platform_wakeup, fih_rc);
  if (fih_not_eq(fih_rc, FIH_SUCCESS))
  {
#else
  {
#endif /* OEMIROT_FAST_WAKE_UP */
    /* Check again if images have been validated, to resist to basic hw attacks */
    for (image_index = 0; image_index < MCUBOOT_IMAGE_NUMBER; image_index++)
    {
      if (ImageValidStatus[image_index] != IMAGE_VALID)
      {
        BOOT_LOG_ERR("Error while double controlling images validation");
        Error_Handler();
      }
    }
  }
#endif /* MCUBOOT_DOUBLE_SIGN_VERIF */

#if defined(MCUBOOT_USE_HASH_REF)
  /* Store new hash references in flash for next boot */
  if (ImageValidHashUpdate)
  {
    if (boot_hash_ref_store())
    {
      BOOT_LOG_ERR("Error while storing hash references");
      Error_Handler();
    }
  }
#endif /* MCUBOOT_USE_HASH_REF */

  /* Check Flow control state */
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STAGE_2);
  uFlowStage = FLOW_STAGE_CFG;

  RNG_DeInit();

  ICACHE_MONITOR_PRINT()

#ifdef OEMIROT_ICACHE_ENABLE
  /* Invalidate ICache before jumping to application */
  if (HAL_ICACHE_Invalidate() != HAL_OK)
  {
    Error_Handler();
  }
#endif /* ICACHE_ENABLED */
  /* Update run time protections for application execution */
  LL_SECU_UpdateRunTimeProtections();

  /* set the secure vector */
  SCB->VTOR = (uint32_t)vector;

  vt = (struct boot_arm_vector_table *)vector;
  /* Check Flow control state */
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STAGE_3_A);
  uFlowStage = FLOW_STAGE_CHK;

  /* Double the update of run time protections, to resist to basic hardware attacks */
  LL_SECU_UpdateRunTimeProtections();

  /* Check Flow control for dynamic protections */
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STAGE_4_A);
  /*  change stack limit  */
  __set_MSPLIM(0);
  /* Restore the Main Stack Pointer Limit register's reset value
   * before passing execution to runtime firmware to make the
   * bootloader transparent to it.
   */
  __set_MSP(vt->msp);
  __DSB();
  __ISB();

#if defined (OEMUROT_ENABLE)

  /* Init RSS jump function descriptor */
  rsslib_sec_Close_Exit_HDPExt = (uint32_t)(RSSLIB_PFUNC->S.CloseExitHDPExt);

  if (rsslib_sec_Close_Exit_HDPExt == 0)
  {
    BOOT_LOG_ERR("Error reading RSS in System Flash!");
    while (1);
  }

  flash_hdpext.Bank    = GetBank(FLASH_BASE + FLASH_HASH_REF_AREA_OFFSET);
  flash_hdpext.NbPages = GetPage(FLASH_BASE + FLASH_BL2_HDP_END_OFFSET) - GetPage(FLASH_BASE + FLASH_HASH_REF_AREA_OFFSET);
  HAL_FLASHEx_ConfigHDPExtension(&flash_hdpext);

  boot_jump_to_RSSExt((uint32_t)&boot_jump_to_RSSExt, rsslib_sec_Close_Exit_HDPExt, RSSLIB_HDP_AREA1_Msk, (uint32_t) vt);
#else  /* OEMUROT_ENABLE */

  /* Init RSS jump function descriptor */
  rsslib_sec_Close_Exit_HDP = (uint32_t)(RSSLIB_PFUNC->S.CloseExitHDP);

  if (rsslib_sec_Close_Exit_HDP == 0)
  {
    BOOT_LOG_ERR("Error reading RSS in System Flash!");
    while (1);
  }

  boot_jump_to_RSS((uint32_t)&boot_jump_to_RSS, rsslib_sec_Close_Exit_HDP, RSSLIB_HDP_AREA1_Msk, (uint32_t) vt);
#endif  /* OEMUROT_ENABLE */

  /* Avoid compiler to pop registers after having changed MSP */
#if !defined(__ICCARM__)
  __builtin_unreachable();
#else
  while (1);
#endif /* defined(__ICCARM__) */
}

/****************************************************************************************/
#if defined(__GNUC__)
/* Ensure local variables of this function are not placed in RAM but in
 * registers only, even in case of low compile optimization configuration
 * at project side.
 * - IAR: No need to force compile optimization level.
 * - KEIL: Force high compile optimization on per-file basis.
 * - STM32CUBEIDE: Force high compile optimization on function only.
 *  */
#if !defined(__ARMCC_VERSION)
__attribute__((optimize("Os")))
#endif /* !__ARMCC_VERSION */
#endif /* __GNUC__ */
/**
  * @brief This function is called to clear all RAM area before jumping in
  * in Secure application .
  * @note
  * @retval void
  */
void boot_clear_bl2_ram_area(void)
{
  __IO uint32_t *pt = (uint32_t *)BL2_DATA_START;
  uint32_t index;


  for (index = 0; index < (BL2_DATA_SIZE / 4); index++)
  {
    pt[index] = 0;
  }

}
/****************************************************************************************/
#if defined(MCUBOOT_USE_HASH_REF)
/**
  * @brief This function store all hash references in flash
  * @return 0 on success; nonzero on failure.
  */
int boot_hash_ref_store(void)
{
  /* Erase hash references flash sector */
  if (FLASH_DEV_NAME.EraseSector(BL2_HASH_REF_ADDR) != ARM_DRIVER_OK)
  {
    return BOOT_EFLASH;
  }

  /* Store new hash references in flash */
  if (FLASH_DEV_NAME.ProgramData(BL2_HASH_REF_ADDR, ImageValidHashRef,
                                 (SHA256_LEN * MCUBOOT_IMAGE_NUMBER)) != ARM_DRIVER_OK)
  {
    return BOOT_EFLASH;
  }

  return 0;
}

/**
  * @brief This function load all hash references from flash
  * @return 0 on success; nonzero on failure.
  */
int boot_hash_ref_load(void)
{
  /* Read hash references */
  if (FLASH_DEV_NAME.ReadData(BL2_HASH_REF_ADDR, ImageValidHashRef,
                              (SHA256_LEN * MCUBOOT_IMAGE_NUMBER)) != ARM_DRIVER_OK)
  {
    return BOOT_EFLASH;
  }

